SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460kcta_template/example/EWARM/hc32f460kcta.svd
                <register>
                    <name>CMU_CKSWR</name>
                    <description>desc CMU_CKSWR</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>CKSW</name>
                            <description>desc CKSW</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_PLLCR</name>
                    <description>desc CMU_PLLCR</description>
                    <addressOffset>0x2A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>MPLLOFF</name>
                            <description>desc MPLLOFF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_UPLLCR</name>
                    <description>desc CMU_UPLLCR</description>
                    <addressOffset>0x2E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>UPLLOFF</name>
                            <description>desc UPLLOFF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_XTALCR</name>
                    <description>desc CMU_XTALCR</description>
                    <addressOffset>0x32</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTP</name>
                            <description>desc XTALSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_HRCCR</name>
                    <description>desc CMU_HRCCR</description>
                    <addressOffset>0x36</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>HRCSTP</name>
                            <description>desc HRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_MRCCR</name>
                    <description>desc CMU_MRCCR</description>
                    <addressOffset>0x38</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>MRCSTP</name>
                            <description>desc MRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_OSCSTBSR</name>
                    <description>desc CMU_OSCSTBSR</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x69</resetMask>
                    <fields>
                        <field>
                            <name>HRCSTBF</name>
                            <description>desc HRCSTBF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTBF</name>
                            <description>desc XTALSTBF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPLLSTBF</name>
                            <description>desc MPLLSTBF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UPLLSTBF</name>
                            <description>desc UPLLSTBF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_MCO1CFGR</name>
                    <description>desc CMU_MCO1CFGR</description>
                    <addressOffset>0x3D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MCO1SEL</name>
                            <description>desc MCO1SEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCO1DIV</name>
                            <description>desc MCO1DIV</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCO1EN</name>
                            <description>desc MCO1EN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_MCO2CFGR</name>
                    <description>desc CMU_MCO2CFGR</description>
                    <addressOffset>0x3E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MCO2SEL</name>
                            <description>desc MCO2SEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCO2DIV</name>
                            <description>desc MCO2DIV</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCO2EN</name>
                            <description>desc MCO2EN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_TPIUCKCFGR</name>
                    <description>desc CMU_TPIUCKCFGR</description>
                    <addressOffset>0x3F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x83</resetMask>
                    <fields>
                        <field>
                            <name>TPIUCKS</name>
                            <description>desc TPIUCKS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TPIUCKOE</name>
                            <description>desc TPIUCKOE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_XTALSTDCR</name>
                    <description>desc CMU_XTALSTDCR</description>
                    <addressOffset>0x40</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x87</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTDIE</name>
                            <description>desc XTALSTDIE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTDRE</name>
                            <description>desc XTALSTDRE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTDRIS</name>
                            <description>desc XTALSTDRIS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTDE</name>
                            <description>desc XTALSTDE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_XTALSTDSR</name>
                    <description>desc CMU_XTALSTDSR</description>
                    <addressOffset>0x41</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTDF</name>
                            <description>desc XTALSTDF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_MRCTRM</name>
                    <description>desc CMU_MRCTRM</description>
                    <addressOffset>0x61</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>CMU_HRCTRM</name>
                    <description>desc CMU_HRCTRM</description>
                    <addressOffset>0x62</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>CMU_XTALSTBCR</name>
                    <description>desc CMU_XTALSTBCR</description>
                    <addressOffset>0xA2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x5</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTB</name>
                            <description>desc XTALSTB</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMU_RSTF0</name>
                    <description>desc RMU_RSTF0</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PORF</name>
                            <description>desc PORF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PINRF</name>
                            <description>desc PINRF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BORF</name>
                            <description>desc BORF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1RF</name>
                            <description>desc PVD1RF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2RF</name>
                            <description>desc PVD2RF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDRF</name>
                            <description>desc WDRF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWDRF</name>
                            <description>desc SWDRF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDRF</name>
                            <description>desc PDRF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRF</name>
                            <description>desc SWRF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPUERF</name>
                            <description>desc MPUERF</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAPERF</name>
                            <description>desc RAPERF</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAECRF</name>
                            <description>desc RAECRF</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKFERF</name>
                            <description>desc CKFERF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALERF</name>
                            <description>desc XTALERF</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MULTIRF</name>
                            <description>desc MULTIRF</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLRF</name>
                            <description>desc CLRF</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWR_PVDICR</name>
                    <description>desc PWR_PVDICR</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x11</resetMask>
                    <fields>
                        <field>
                            <name>PVD1NMIS</name>
                            <description>desc PVD1NMIS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2NMIS</name>
                            <description>desc PVD2NMIS</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWR_PVDDSR</name>
                    <description>desc PWR_PVDDSR</description>
                    <addressOffset>0xE1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x11</resetValue>
                    <resetMask>0x33</resetMask>
                    <fields>
                        <field>
                            <name>PVD1MON</name>
                            <description>desc PVD1MON</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1DETFLG</name>
                            <description>desc PVD1DETFLG</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2MON</name>
                            <description>desc PVD2MON</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2DETFLG</name>
                            <description>desc PVD2DETFLG</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
